---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebStructuralTypesParam
source: html/8e570cce-a0f1-85c8-9476-f017d1c7bcf8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussFamilyDiagWebStructuralTypesParam Property

"Structural Framing Type"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussFamilyDiagWebStructuralTypesParam { get; }
```